{
  "schemaVersion": "1.0.0",
  "readme": "Provides an extended \"Holy Grail\" layout as a web component.",
  "modules": [
    {
      "kind": "javascript-module",
      "path": "src/index.js",
      "declarations": [
        {
          "kind": "class",
          "name": "HolyGrailElement",
          "description": "Provides an extended \"Holy Grail\" layout as a web component.",
          "slots": [
            {
              "name": "header",
              "description": "Topmost horizontal slot, as wide as the whole element, as high as its content."
            },
            {
              "name": "top-nav",
              "description": "A horizontal slot above the \"main\" slot, as wide as the \"main\" slot, as high as its content."
            },
            {
              "name": "main",
              "description": "A large slot in the middle of the element, fills the rest of width and height of the element."
            },
            {
              "name": "bottom-nav",
              "description": "A horizontal slot below the \"main\" slot, as wide as the \"main\" slot, as high as its content."
            },
            {
              "name": "start-side",
              "description": "A vertical slot on the left side(in the left-to-right text-writing direction) with an explicit width (25% of the element by default), as high as the content between the \"header\" and \"footer\" slots. The width can be customised by a style using the part \"start-side\" in the selector."
            },
            {
              "name": "end-side",
              "description": "A vertical slot on the right side (in the left-to-right text-writing direction) with an explicit width (25% of the element by default), as high as the content between the \"header\" and \"footer\" slots. The width can be customised by a style using the part \"end-side\" in the selector."
            },
            {
              "name": "footer",
              "description": "Bottommost horizontal slot, as wide as the whole element, as high as its content."
            }
          ],
          "superclass": {
            "name": "HTMLElement"
          },
          "tagName": "holy-grail",
          "customElement": true
        }
      ],
      "exports": [
        {
          "kind": "js",
          "name": "HolyGrailElement",
          "declaration": {
            "name": "HolyGrailElement",
            "module": "src/graph.js"
          }
        },
        {
          "kind": "custom-element-definition",
          "name": "holy-grail",
          "declaration": {
            "name": "HolyGrailElement",
            "module": "src/index.js"
          }
        }
      ]
    }
  ]
}